var imgsrc="";
//验证道路长度规则
var roadlen_regex={
	rule:/(^[1-9]\d{1,7}|^[0-9])(\.[0-9]{1,3}|)$/,//验证输入必须是数字，整数部分最大8位，小数部分最大3位
	msg:"只能输入数字,整数部分最长8位，小数部分最长3位!"
};
//验证道路宽度规则
var roadwid_regex={
	rule:/(^[1-9]\d{1,4}|^[0-9])(\.[0-9]{1,2}|)$/,//验证输入必须是数字，整数部分最大5位，小数部分最大2位
	msg:"只能输入数字,整数部分最长5位，小数部分最长2位!"
};

//验证道路 车道数
var roadlane_regex={
	rule:/^[1-9][0-9]|[0-9]$/,//验证输入必须是0-99数字
	msg:"只能输入0-99整数!"
};

//验证经度规则
var lng_regex={
	rule:/^(-?((180)|(((1[0-7]\d)|(\d{1,2}))(\.\d{1,6})?)))$/,//验证经度规则，输入为-180到+180
	msg:"只能输入-180到180范围数字,可保留6位小数!"
};
//验证维度规则
var lat_regex={
	rule:/^(-?((90)|((([0-8]\d)|(\d{1}))(\.\d{1,6})?)))$/,//验证维度规则，输入为-90到+90
	msg:"只能输入-90到90范围数字，可保留6位小数!"
};

var phone_regex={
	rule:/(^1[3|4|5|8]\d{9}$)|(^0\d{2}-\d{8}$)|(^0\d{3}-\d{7}$)|(^0\d{10}$)|(^\d{7}$)|(^\d{8}$)/,//验证手机号码
	msg:"输入错误！格式支持(手机号、区号加直拨号、直拨号)"
};

var adr_regex={
	rule:/^[a-zA-Z0-9\u4E00-\u9FA5\,\.\，\。\-\#\;\、\；\: ]{0,100}$/,//地址验证
	msg:"请输入正确地址(仅支持逗号、句号、分号、冒号和#)！"
}

var name_regex={
	rule:/^[a-zA-Z\u4E00-\u9FA5]{0,100}$/,//姓名验证
	msg:"请输入正确的名字（仅中英文或汉字）！"
}

var txt_regex={
	rule:/^[a-zA-Z0-9\u4E00-\u9FA5\,\.\，\。\-\#\;\、\；\!\！\?\？\_\——\“\”\‘\’\'\"\(\)\:\ ]{0,1000}$/,//验证是否输入特殊字符｛，,.。'"！@#￥%……&*（）——+【】[]|:;~`<>?-= 	｝
	msg:"只能输入中英文、数字、汉字、基本标点符号！"
}